LEXICON_Invite: dict[str, str] = {
    '/start': f'Здравствуй, <b>Новобранец!</b>\n'
              f'Я - ARACHNA: Автономная Речевая Ассистентка С Хранилищем Нейронных Алгоритмов.\n'
              f'У вас есть возможность участвовать в колонизации новой планеты в роли пилота аватара.',
    'st_0': f'Для повторного запуска напишите /start или начать',
    'st_1': 'Я думаю вы в курсе или догаываетесь, что наша планета Земля умирает. Поэтому, с помощью математических расчетов была найдена новая планета с почти пригодными для жизни условиями.',
    'st_2': f'NOVA - Nev Orbital Viable Atmosphere (Новая орбитальная планета с пригодной атмосферой).\n'
            f'Наш новый дом. По результатам зондирования на планете пвышенная радивция, есть своя флора, фауна и возможно даже признаки магии.',
    'st_3': 'Вы готовы к первому подключению вашего аватара?',
    'st_4': 'Регистрация прошла успешно! Прошу об окуратном отношении к аватару. Каждый Аватар это человекоподобный дройд который стоит более 2.3 милиардов евро.',
    'st_5': f'У вашего автатара на данный момент будет стандартный набор колонизатора. Экипировка Космонавта, пистолет, шутенка, аптечки и бинты.\n'
            f'К сожаению Экипировка в связи с перелетом сильно поношена, но я уверенна выбыстро найдете ей замену.',
    'landing_place': 'Локация Место посадки',
}

#LBut
LEXICON_BUTTON: dict[str, str] = {
    'next': 'Дальше',
    'Next': 'Далее',
    'back': 'Назад',
    'cansel': 'Выйти',
    'register': 'Зарегистрироваться',
    'begin_start': 'начать',
    'specifications': 'Характеристики',
    'backpack': 'Рюкзак',
    'move': 'Переместиться',
    'location': 'Локация',
    'general': 'Общее',
    'armor': 'Брони',
    'guns': 'Оружия',
    'storage': 'Хранилище',
    'laboratory': 'Лаборатория',
    'all': 'Все',
    'ok': 'ok',
    'to_the_full': 'До полного',
    'take_with_u': 'Взять с собой',
    'reverse': 'Обратно',
    '': '',

    'storage_trash': 'Хлам',
    'storage_wardrobe': 'Шкаф',
    'storage_guns': 'Оружейная',
    'storage_bio': 'био',
    'bio': 'био ресурса',
    'pocket': 'Карман',
    'pocket1': 'Карман 1', 'Pocket1': 'Кармане 1', 'POCKET1': 'Карман 1',
    'pocket2': 'Карман 2', 'Pocket2': 'Кармане 2', 'POCKET2': 'Карман 2',
    'cell_1': 'Ячейка 1',  'Cell_1': 'Ячейке 1',   'CELL_1': 'Ячейку 1',
    'cell_2': 'Ячейка 2',  'Cell_2': 'Ячейке 2',   'CELL_2': 'Ячейку 2',
    'cell_3': 'Ячейка 3',  'Cell_3': 'Ячейке 3',   'CELL_3': 'Ячейку 3',
    'cell_4': 'Ячейка 4',  'Cell_4': 'Ячейке 4',   'CELL_4': 'Ячейку 4',

    '': '',
    '': '',
    '': '',

    'empty': 'Пусто',
    'put_in_storage': 'Положить в хранилище',
    'put': 'Доложить',
    'transfer': 'Переложить',
    'use': 'Использовать',
    'throw_it_away': 'Выкинуть',
    'put_in_backpack': 'Положить в рюкзак',

}

#LST
LEXICON_STORAGE_TRASH: dict[str, str] = {
    'f_aid': 'Аптечка', 'F_aid': 'Аптечку',
    'f_aid_s': 'Аптечка простая', 'F_aid_s': 'Аптечку простую',
    'bandages': 'Бинты', 'Bandages': 'Бинты',
    'bandages_s': 'Бинт простой', 'Bandages_s': 'Бинт простой',
    'canned_meat': 'Тушенка',  'Canned_meat': 'Тушенку',
    'fried_meat': 'Жаренное мясо',  'Fried_meat': 'Жаренное мясо',
    'fried_veins': 'Жаренные жилы', 'Fried_veins': 'Жаренные жилы',
    'berries': 'Ягодные виферы', 'Berries': 'Ягодные виферы',
    'bones': 'Кости', 'Bones': 'Кости',
    'veins': 'Жилы',  'Veins': 'Жилы',
    'vine_leaves': 'Листья лозы',  'Vine_leaves': 'Листья лозы',
    'yel_fl': 'Стебель желтоцвета', 'Yel_fl': 'Стебель желтоцвета',
    'stick': 'Палка', 'Stick': 'Палку',
    'raw_meat': 'Сырое мясо', 'Raw_meat': 'Сырое мясо',
    'seed_zlg': 'Семечка златоглавки', 'Seed_zlg': 'Семечку златоглавки',
    'bio': 'био', 'Bio': 'био',
    # эта затычка для LST в кейборде
    'helmet_kosmonavt': 'Шлем космонавта',
    'helmet_wanderer': 'Шлем странника',
    'helmet_reinforced': 'Усиленный шлем',
    'dress_kosmonavt': 'Костюм космонавта',
    'dress_wanderer': 'Костюм странника',
    'dress_reinforced': 'Усиленный костюм',
    'shoes_kosmonavt': 'Ботинки космонавта',
    'shoes_wanderer': 'Ботинки странника',
    'shoes_reinforced': 'Усиленные ботинки',
    'backpack_foliage': 'Рюкзак лиственный',
    'backpack_leana': 'Рюкзак лиственно-леанный',
    'spear': 'Заточенное копье',
    'G17': 'G-17',
}

#All_Th --- всё, что может лежать в рюкзаке
LEXICON_ALL_THINGS: dict[str, str] = {
    'f_aid': 'Аптечка', 'F_aid': 'Аптечку', 'F_AID': 'Аптечки', # aaa - именительный, bbb - ?? ссс - ??
    'f_aid_s': 'Аптечка простая', 'F_aid_s': 'Аптечку простую', 'F_AID_S': 'Простые аптечки',
    'bandages': 'Бинты', 'Bandages': 'Бинты', 'BANDAGES': 'Бинты',
    'bandages_s': 'Бинт простой', 'Bandages_s': 'Бинт простой', 'BANDAGES_S': 'Бинты простые',
    'canned_meat': 'Тушенка',  'Canned_meat': 'Тушенку', 'CANNED_MEAT': 'Тушенка',
    'fried_meat': 'Жаренное мясо',  'Fried_meat': 'Жаренное мясо', 'FRIED_MEAT': 'Жаренное мясо',
    'fried_veins': 'Жаренные жилы', 'Fried_veins': 'Жаренные жилы', 'FRIED_VEINS': 'Жаренные жилы',
    'berries': 'Ягодные вифиеры', 'Berries': 'Ягодные вифиеры', 'BERRIES': 'Ягодами вифиерами',
    'bones': 'Кости', 'Bones': 'Кости', 'BONES': 'Кости',
    'veins': 'Жилы',  'Veins': 'Жилы', 'VEINS': 'Жилы',
    'vine_leaves': 'Листья лозы',  'Vine_leaves': 'Листья лозы', 'VINE_LEAVES': 'Листьями лозы',
    'yel_fl': 'Стебель желтоцвета', 'Yel_fl': 'Стебель желтоцвета', 'YEL_FL': 'Стеблем желтоцвета',
    'stick': 'Палка', 'Stick': 'Палку', 'STICK': 'Палкой',
    'raw_meat': 'Сырое мясо', 'Raw_meat': 'Сырое мясо', 'RAW_MEAT': 'Сырое мясо',
    'seed_zlg': 'Семечка златоглавки', 'Seed_zlg': 'Семечку златоглавки', 'SEED_ZLG' : 'Семечкой златоглавки',
    'bio': 'био', 'Bio': 'био', 'BIO': 'био',

    'helmet_kosmonavt': 'Шлем космонавта', 'Helmet_kosmonavt': 'Шлем космонавта',
    'helmet_wanderer': 'Шлем странника', 'Helmet_wanderer': 'Шлем странника',
    'helmet_reinforced': 'Усиленный шлем', 'Helmet_reinforced': 'Усиленный шлем',
    'dress_kosmonavt': 'Костюм космонавта', 'Dress_kosmonavt': 'Костюм космонавта',
    'dress_wanderer': 'Костюм странника', 'Dress_wanderer': 'Костюм странника',
    'dress_reinforced': 'Усиленный костюм', 'Dress_reinforced': 'Усиленный костюм',
    'shoes_kosmonavt': 'Ботинки космонавта', 'Shoes_kosmonavt': 'Ботинки космонавта',
    'shoes_wanderer': 'Ботинки странника', 'Shoes_wanderer': 'Ботинки странника',
    'shoes_reinforced': 'Усиленные ботинки', 'Shoes_reinforced': 'Усиленные ботинки',
    'backpack_foliage': 'Рюкзак лиственный', 'Backpack_foliage': 'Рюкзак лиственный',
    'backpack_leana': 'Рюкзак лиственно-леанный', 'Backpack_leana': 'Рюкзак лиственно-леанный',
    'spear': 'Заточенное копье', 'Spear': 'Заточенное копье',
    'G17': 'G-17', 'G17': 'G-17',
    'nothink': 'Кулак', 'Nothink': 'Кулак', 'NOTHINK': 'Кулак',
    'left_hand': 'левая рука', 'Left_hand': 'левой руке', 'LEFT_HAND': 'левую руку',
    'right_hand': 'правая рука', 'Right_hand': 'правой руке', 'RIGHT_HAND': 'правую руку',
    'left': 'левая рука', 'Left': 'левой руке', 'LEFT': 'левую руку',
    'right': 'правая рука', 'Right': 'правой руке', 'RIGHT': 'правую руку',
    'landing_place': 'Место посадки',
    'location_meadows': 'Бескрайние луга',
    'pocket1': 'Карман 1', 'Pocket1': 'Кармане 1', 'POCKET1': 'Карман 1',
    'pocket2': 'Карман 2', 'Pocket2': 'Кармане 2', 'POCKET2': 'Карман 2',
    'cell_1': 'Ячейка 1',  'Cell_1': 'Ячейке 1',   'CELL_1': 'Ячейку 1',
    'cell_2': 'Ячейка 2',  'Cell_2': 'Ячейке 2',   'CELL_2': 'Ячейку 2',
    'cell_3': 'Ячейка 3',  'Cell_3': 'Ячейке 3',   'CELL_3': 'Ячейку 3',
    'cell_4': 'Ячейка 4',  'Cell_4': 'Ячейке 4',   'CELL_4': 'Ячейку 4',
    'luvron_polevoy': 'Луврон полевой', 'Luvron_polevoy': 'Луврон полевой', 'lUVRON_POLEVOY': 'Луврон полевой',
    'blue_rabbit': 'Синий кролик', 'Blue_rabbit': 'Синий кролик', 'BLUE_RABBIT': 'Синий кролик',
    'daron': 'Песчаный дарон', 'Daron': 'Песчаный дарон', 'DARON': 'Песчаный дарон',
}

list_storage_trash: list = ['f_aid', 'f_aid_s', 'bandages', 'bandages_s',
                            'canned_meat', 'fried_meat', 'fried_veins', 'berries', 'bones', 'veins',
                            'vine_leaves', 'yel_fl', 'stick', 'raw_meat', 'seed_zlg']

list_storage_trash_drag: list = ['f_aid', 'f_aid_s', 'bandages', 'bandages_s',
                            'canned_meat', 'fried_meat', 'fried_veins', 'berries', ]

list_storage_trash_craft: list = ['bones', 'veins', 'vine_leaves', 'yel_fl',
                                  'stick', 'raw_meat', 'seed_zlg']

list_storage_wardrobe: list = ['helmet_kosmonavt', 'helmet_wanderer', 'helmet_reinforced',
                               'dress_kosmonavt', 'dress_wanderer', 'dress_reinforced',
                               'shoes_kosmonavt', 'shoes_wanderer', 'shoes_reinforced',
                               'backpack_foliage', 'backpack_leana', ]

list_storage_gun: list = ['G17', 'spear', 'nothink']

list_storage_wardrobe_gun: list = ['helmet_kosmonavt', 'helmet_wanderer', 'helmet_reinforced',
                               'dress_kosmonavt', 'dress_wanderer', 'dress_reinforced',
                               'shoes_kosmonavt', 'shoes_wanderer', 'shoes_reinforced',
                               'backpack_foliage', 'backpack_leana', 'G17', 'spear', 'nothink']

list_storage_wardrobe_and_gun_and_craft: list = ['helmet_kosmonavt', 'helmet_wanderer', 'helmet_reinforced',
                               'dress_kosmonavt', 'dress_wanderer', 'dress_reinforced',
                               'shoes_kosmonavt', 'shoes_wanderer', 'shoes_reinforced',
                               'backpack_foliage', 'backpack_leana', 'G17', 'spear', 'nothink',
                               'bones', 'veins', 'vine_leaves', 'yel_fl',
                                  'stick', 'raw_meat', 'seed_zlg',]


dict_storage_trash_bio: dict[str, str] = {'f_aid': '200', 'f_aid_s': '70', 'bandages': '60', 'bandages_s': '20',
                            'canned_meat': '30', 'fried_meat': '22', 'fried_veins': '19', 'berries': '2', 'bones': '10', 'veins': '6',
                            'vine_leaves': '4', 'yel_fl': '4', 'stick': '4', 'raw_meat': '8', 'seed_zlg': '5',}

dict_use_storage_trash: dict = {'f_aid': '100', 'f_aid_s': '35', 'bandages': '35', 'bandages_s': '15',
                            'canned_meat': '18', 'fried_meat': '11', 'fried_veins': '9', 'berries': '9',}

dict_gun_description: dict = {
    'G17': ['🔪0-35-45/🧪0-0-0/⚡️0-0-10', 20], # ставлю молнию в конец
    'spear': ['🔪0-0-30/🧪0-0-25/⚡️0-0-5', 15],
    'nothink' : ['🔪0-0-5/🧪0-0-2/⚡️0-0-0', 0],
    'G17_description': "G-17  🔪0-35-45/🧪0-0-10/⚡️0-0-0 20хп   Ремонт если состояние > 50 % +1хп(50био)+5хп(2кристала+25био), если состояние < 50 % +10хп(4кристала+50био)",
    'spear_description': f'Заточенное копье 🔪0-0-30/🧪0-0-25/⚡️0-0-5 15хп (350био) Ремонт если состояние > 50 % +1хп(30био), '
                         f'если состояние < 50 % +5хп(Палка 9шт. + Кости 5шт. + Жилы 4шт + 50био)',
    'G17_battle': [['🔪0/🧪0/⚡️0', '🔪35/🧪0/⚡️0' , '🔪45/🧪0/⚡️10'], [0,0,0], [35,0,0], [45,0,10]], # дальний - средний - ближний /// баллистический - химический - электро
    'spear_battle': [['🔪0/🧪0/⚡️0', '🔪0/🧪0/⚡️0' , '🔪30/🧪25/⚡️5'], [0,0,0], [0,0,0], [30,25,5]],
    'nothink_battle': [['🔪0/🧪0/⚡️0', '🔪0/🧪0/⚡️0' , '🔪5/🧪25/⚡️5'], [0,0,0], [0,0,0], [5,2,0]],
    }

dict_gun: dict = {
    'G17': [[0,0,0], [35,0,0], [45,0,10]], # дальний - средний - ближний /// баллистический - химический - электро
    'spear': [[0,0,0], [0,0,0], [30,25,5]],
    'nothink': [[0,0,0], [0,0,0], [5,2,0]],
    }

dict_NPS: dict = {
    'luvron_polevoy': [[25, 10, 0], [5, 10, 5]],
    'blue_rabbit': [[5, 3, 0], [2, 2, 5]], # первый список нападение, второй защита
    'daron': [[5, 10, 35], [35, 15, 0], [25, 5, 25]], # первый и второй список нападение (среднее), третий защита
}

dict_armor: dict = {
    'helmet_kosmonavt': ['Шлем космонавта - Стандартный шлем космонавта.\nГрамостки,тяжелый и неудобный.', 5, 35, 45, 5000],
    'helmet_wanderer': ['Шлем Странника - Легкая и простая защита головы.\nМожно сделать изтого что есть под рукой.', 10, 10, 10, 1000],
    'helmet_reinforced': ['Улучшенный шлем - Шлем странника.\nУсиленный каркасом из костей и перетяннутый жилами.', 15, 10, 10, 1200],

    'dress_kosmonavt': ['Костюм космонавта - Стандартный костюм космонавта.\nЖаркий, неудобный большой и очень заметный.', 10, 30, 35, 5500],
    'dress_wanderer': ['Костюм Странника - Легкая и простая защита тела.\nМожно сделать из того что есть под рукой.', 15, 10, 5, 1100],
    'dress_reinforced': ['Улучшенный костюм - Костюм странника.\nУсиленный каркасом из костей и перетяннутый жилами.', 20, 15, 10, 1400],

    'shoes_kosmonavt': ['Ботинки космонавта - Стандартный ботинки космонавта.\nТяжелые и шумные.', 5, 30, 35, 4000],
    'shoes_wanderer': ['Ботинки Странника - Легкая и простая защита ног.\nМожно сделать из того что есть под рукой.', 5, 5, 5, 800],
    'shoes_reinforced': ['Улучшенный ботинки - Ботинки странника.\nУсиленные каркасом из костей и перетянутый жилами.', 10, 10, 5, 900],

    'backpack_foliage': ['Рюкзак лиственный - простой рюкзак сделаный из подручных сретств\n', '2 ячейки рюкзака\n2 кармана', 150],
    'backpack_leana': ['Рюкзак лиственно-лиановый - рюкзак лиственный укремоенный костями и жилами\n', '4 ячейки рюкзака\n2 кармана', 180]
}

dict_repair_description: dict = {
    'helmet_kosmonavt': 'Шлем космонавта 5/35/45 5000хп Ремонт если состояние >50% +100хп(100био) +1000хп(4кристала+50био), если состояние <50% +1000хп(4кристала+50био)',
    'helmet_wanderer': 'Шлем странника 10/10/10 1000хп Ремонт если состояние >50% +50хп(25био), если состояние < 50% +200хп(Стебель желтоцвета 12 шт + Палка 8 + Листья лозы 5шт. шт+50био)',
    'helmet_reinforced': 'Усиленный шлем 15/10/10 1200хп Ремонт если состояние >50% +50хп(25био), если состояние <50% +200хп(Кости 3шт + Жилы 2шт + 50био)',

    'dress_kosmonavt': 'Костюм космонавта 10/30/35 5500хп Ремонт если состояние >50% +100хп(100био) +1000хп(4кристала+50био), если состояние <50% +1000хп(4кристала+50био)',
    'dress_wanderer': 'Костюм странника 15/10/5 1100хп Ремонт если состояние >50% +50хп(25био), если состояние <50% +200хп(Стебель желтоцвета 12 шт + Палка 8 + Листья лозы 5шт. шт+50био)',
    'dress_reinforced': 'Усиленный Костюм 20/15/10 1400хп Ремонт если состояние >50% +50хп(25био), если состояние <50% +200хп(Кости 3шт + Жилы 2шт + 50био)',

    'shoes_kosmonavt': 'Ботинки космонавта 5/30/35 4000хп Ремонт если состояние >50% +100хп(100био) +1000хп(4кристала+50био), если состояние <50% +1000хп(4кристала+50био',
    'shoes_wanderer': 'Ботинки странника 5/5/5 800хп   Ремонт если состояние >50% +50хп(25био), если состояние <50% +200хп(Стебель желтоцвета 12 шт + Палка 8 + Листья лозы 5шт. шт+50био)',
    'shoes_reinforced': 'Усиленный Ботинки 10/10/5 900хп Ремонт если состояние>50% +50хп(25био), если состояние <50% +200хп(Кости 3шт + Жилы 2шт + 50био)',

    'backpack_foliage': 'Рюкзак лиственный 4 150хп    Ремонт если состояние >50% +10хп(20био), если состояние <50% +50хп(Стебель желтоцвета 4 шт + Палка 6 шт. + Листья лозы 5шт. + 20био)',
    'backpack_leana': 'Рюкзак лиственно-леанный 6 180хп   Ремонт если состояние >50% +10хп(20био), если состояние <50% +50хп(Кости 3 шт. +  Жилы 2шт + 20био)',
    'G17':  '🔪0-35-45/⚡️0-0-0/🧪0-0-10& 20хп   Ремонт если состояние >50% +1хп(50био) +5хп(2кристала+25био), если состояние <50% +10хп(4кристала+50био)',
    'spear': 'Заточенное копье 🔪0-0-30/🧪0-0-25/⚡️0-0-5 15хп (350био) Ремонт если состояние >50% +1хп(30био) , если состояние <50% +5хп(Палка 9шт. + Кости 5шт. + Жилы 4шт + 50био)'

}

dict_repair: dict = {# если меньше 50 выбора нет, только последний словарь
    'helmet_kosmonavt': [[100, 100], [1000, 50, 4]], #[if>50% [xp, bio] | [xp, bio, kristal] if<50% [xp, bio, kristal] ОДИНАКОВО,
    'helmet_wanderer': [[50, 25], [200, 12, 8, 5, 50]], # [if>50% [xp, bio], if<50% [xp, Стебель желтоцвета, Палка, Листья лозы, био]]
    'helmet_reinforced': [[50, 25], [200, 3, 2, 50]], # [if>50% [xp, bio], if<50% [xp, Кости, Жилы, био]]

    'dress_kosmonavt': [[100, 100], [1000, 50, 4]],
    'dress_wanderer': [[50, 25], [200, 12, 8, 5, 50]],
    'dress_reinforced': [[50, 25], [200, 3, 2, 50]],

    'shoes_kosmonavt': [[100, 100], [1000, 50, 4]],
    'shoes_wanderer': [[50, 25], [200, 12, 8, 5, 50]],
    'shoes_reinforced': [[50, 25], [200, 3, 2, 50]],

    'backpack_foliage': [[10, 20], [50, 4, 6, 5, 20]],
    'backpack_leana': [[10, 20], [50, 3, 2, 20]],

    'G17':  [[1, 50], [5, 25, 2], [10, 50, 4]], #[if>50% [xp, bio] | [xp, bio, kristal] if<50% [xp, bio, kristal],
    'spear': [[1, 30], [5, 9, 5, 4, 50]] # [if>50% [xp, bio], if<50% [xp, Палка, Кости, Жилы био]]

}

dict_percent_xp: dict = {
    'helmet_kosmonavt': 5000, 'helmet_wanderer': 1000, 'helmet_reinforced': 1200,
    'dress_kosmonavt': 5500, 'dress_wanderer': 1100, 'dress_reinforced': 1400,
    'shoes_kosmonavt': 4000, 'shoes_wanderer': 800, 'shoes_reinforced': 900,
    'backpack_foliage': 150, 'backpack_leana': 180,
    'G17':  20, 'spear': 15
}

#LSW
LEXICON_STORAGE_WARDROBE: dict[str, str] = {
    'helmet_kosmonavt': 'Шлем космонавта',
    'helmet_wanderer': 'Шлем странника',
    'helmet_reinforced': 'Усиленный шлем',
    'dress_kosmonavt': 'Костюм космонавта',
    'dress_wanderer': 'Костюм странника',
    'dress_reinforced': 'Усиленный костюм',
    'shoes_kosmonavt': 'Ботинки космонавта',
    'shoes_wanderer': 'Ботинки странника',
    'shoes_reinforced': 'Усиленные ботинки',
    'backpack_foliage': 'Рюкзак лиственный',
    'backpack_leana': 'Рюкзак лиственно-леанный',

}


#LSG
LEXICON_STORAGE_GUN: dict[str, str] = {
    'spear': 'Заточенное копье',
    'G17': 'G-17',}

#LL
LEXICON_Laboratory: dict[str, str] = {
    'create': 'Создать',
    'dispose_of': 'Утилизировать',
    'repair': 'Ремонт',
    'drug': 'Лекарства',
    'armor': 'Броню',
    'guns': 'Оружие',


    '': '',

    'fried_meat': 'Нужно в хранилище.\nСырое мясо 2 шт.\nСемечка златоглавки 1 шт.',
    'fried_veins': 'Нужно в хранилище.\nЖилы 2 шт.\nСемечка златоглавки 1 шт.',
    'bandages_s': 'Нужно в хранилище.\nСтебель желтоцвета 5 шт.\nЛистья лозы 4 шт.',
    'f_aid_s': 'Нужно в хранилище.\nБинты простые 3 шт.\n Семечка злотоглавки 2 шт.',

    'spear_create': 'Нужно в хранилище.\nПалка 31 шт. \nКости 8 шт. \nЖилы 9шт. \n150 био',

    'helmet_wanderer': 'Нужно в хранилище.\nСтебель желтоцвета 35 шт.\nПалка 37 шт.\nЛистья лозы 28 шт.\n200 био',
    'helmet_reinforced': 'Нужно в хранилище.\nШлем странника 1 шт.\nКости 7 шт.\nЖилы 5 шт.',
    'dress_wanderer': 'Нужно в хранилище.\nСтебель желтоцвета 37 шт.\nПалка 42 шт.\nЛистья лозы 33 шт.\n230 био',
    'dress_reinforced': 'Нужно в хранилище.\nКостюм странника 1 шт.\nКости 10 шт.\nЖилы 8 шт.',
    'shoes_wanderer': 'Нужно в хранилище.\nСтебель желтоцвета 21 шт.\nПалка 28 шт.\nЛистья лозы 24 шт.\n180 био',
    'shoes_reinforced': 'Нужно в хранилище.\nБотинки странника 1 шт.\nКости 6 шт.\nЖилы 4 шт.',
    'backpack_foliage': 'Нужно в хранилище.\nСтебель желтоцвета 22 шт.\n Палка 25 шт.\nЛистья лозы 18 шт.\n100 био',
    'backpack_leana': 'Нужно в хранилище.\nРюкзак лиственный 1 шт.\nКости 3 шт.\nЖилы 2 шт.',
    'spear': 'Заточенное копье',

    'lb2': 'Что вы хотите создать?',
    'lb3': 'Что вы хотите создать?',
    'lb5': 'Не хватает ингридиентов в хранилище',
    'lb5_1': 'Вы создали ',

    'lb8': 'Вы создали Заточенное копье 1 шт.',
    'lb9': 'Не хватает БИО',
    '': '',
    'd1': 'Всё, что у вас есть в Хранилище',
    'd2': 'У вас ',
    'd2_1': ' шт.\nСколько утилизировать?',
    'd3': 'У вас нет ',
    'd3_1': 'Вы Утилизировали ',
    'd3_2': '. \nВы получили ',
    'd3_3': ' био ресурса.',

    'rep1': 'Что ремонтировать?',
    'rep2': 'В хранилище находится',

    'lp2': 'Какое хранилище?',

    'tr1': 'У вас ничего нет',
    'tr2': 'Что делаем?',
    'tr3': 'Сюда положить нельзя',
    'tr3_куда': 'В какую ячейку кладем',
    'tr4': 'У вас нет свободного места в ',
    'tr4_1': 'У вас есть ',
    'tr4_2': ' шт. \nСколько хотите положить в ',
    'tr4_3': 'Вы не можете положить ',
    'tr4_крафт': 'Вы не можете положить крафт в карманы, в карманы можно положить только лекарство. \nКрафт можно положить только в ячейки рюкзака.',

    'tr44_1': 'В ',
    'tr44_2': ' уже лежит ',
    'tr44_3': ' шт. \nУ вас есть ',
    'tr44_4': ' шт. \nСколько хотите положить в ',
    'tr44_5': ' ничего не лежит. ',
    'tr44_6': '\nУ вас есть ',

    'tr4_4': '\nТам находится ',
    'tr4_5': 'Вы не можете положить ',
    'tr5': 'Вы положили ',
    'tr5_1': ' шт. \n в ',

    'bio1': 'У вас в хранилище',
    'bio2': 'Куда деваем био ресурс?',
    'bio2_1': 'У вас нет био ресурса',
    'bio2_2': 'Рюкзак не надет. Класть некуда.',
    'bio3': 'У вас биоресурса',
    'bio3_1': '.\nСколько взять?',
    'bio3_2': '.\n Вы собираетесь взять ',
    'bio4': 'Вы взяли весь биоресурс',
    'ward1': 'В шкафу находится:',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
}

#LB
LEXICON_Backpack: dict[str, str] = {
    'b1': 'У вас в рюкзаке',
    'b2': 'Быстрая ячейка 2.\nЗдесь ничего нет',
    'b3': 'У вас Аптечка ',
    'b3_1': ' шт.\nв Быстрой ячейке 1\n\nчто делаем?',
    'b3_2': 'У вас нет аптечек в лиственном рюкзаке. \nВы можете их сюда только доложить',
    'b4': 'Вы хотите использовать аптечку?\nОна востановит до 35ХП\nМаксимальное значение ХП: 100ХП\nУ вас: ',
    'b5': 'Вы использовали аптечку 1шт.\nОсталось ',
    'b5_1': 'шт.\nУ вас ',
    'b5_2': 'ХП',
    'b5_3': 'У вас нет аптечек. Ваш хр =',
    'b6': 'У вас Аптечка ',
    'b6_1': 'шт.\nСколько выкинуть?',
    'b6_2': 'У вас нет аптечек в лиственном рюкзаке',
    'b7': 'Вы выкинули ',
    'b7_1': '\n Аптечка',
    'b8': 'У вас Аптечка ',
    'b8_1': 'шт.\nСколько положить в хранилище?',
    'b8_2': 'У вас нет аптечек в лиственном рюкзаке',
    'b9': 'Вы положили в хналилище ',
    'b9_1': '\n Аптечка',

    'b10': 'У вас в хранилище нет Аптечка',
    'b10_1': 'У вас в хранилище ',
    'b10_2': ' шт. Аптечка\nВ быстрой ячейке\n',
    'b10_3': 'свободного места ',
    'b10_4': '\nСколько доложить?',
    'b11': 'Вы доложили из хранилища \nАптечка',
    'b11_1': ' шт.\nУ вас в быстрой ячейке 1\n Аптечка ',
    'b11_2': 'шт',
    'b12': '',
    'b13': '',
    'b14': '',
    'b15': '',
}

#LScrTr
LEXICON_scribe_trash: dict[str, str] = {
    'f_aid': 'Аптечка - Земная аптечка поможет выжить в сложной ситуации',
    'f_aid_s': 'Аптечка простая - Аптечка сделана из местных ингредиентов',
    'bandages': 'Бинты - Земные стерильные бинты залечить легкие и средние раны',
    'bandages_s': 'Бинты простые - Плотная повязка из листьев',
    'canned_meat': 'Тушенка - Запас сил и энергии на несколько дней',
    'fried_meat': 'Жареное мясо - Обгорелое мясо местной фауны',
    'fried_veins': 'Жаренные жилы - Обгорелые куски шкуры местной фауны',
    'berries': 'Ягодные виферы - красные ягоды похожие на черешню растущие на невысоких кустарниках',
    'bones': 'Кости - части тела хищных животных',
    'veins': 'Жилы - Куски шкуры и тканей животных',
    'vine_leaves': 'Листья лозы - Большие листья кустарниковой лозы',
    'yel_fl': 'Стебель желтоцвета - Стебель тростника полевого',
    'stick': 'Палка - Неопределимая ветка углеродсодержащего растения',
    'raw_meat': 'Сырое мясо - Кусок мяса животного',
    'seed_zlg': 'Семечка златоглавки - Ядовитая семечка оставляющая химические и термические ожеги',
    'bio': 'Био Ресурс - Основной жизненный и торговый ресурс на планете',
    'luvron_polevoy': '-Луврон полевой\nХП 60-70\nУРОН\n-Дальний -\n-Средний -\n-Ближний 🔪25/🧪10/⚡️0\nЗащита 🔪5/🧪10/⚡️5',
    'blue_rabbit': '-Синий кролик\nХП 20-25\nУРОН\n-Дальний -\n-Средний -\n-Ближний 🔪5/🧪3/⚡️0\nЗащита 🔪2/🧪2/⚡️5',
    'daron': '-Песчаный дарон\nХП 110-140\nУРОН 10-45(Разряд молнии,средняя) 35-50(Удар Хвостом,ближняя)/n-Дальний -\n-Средний 🔪5/🧪10/⚡️35\n-Ближний 🔪35/🧪15/⚡️0\nЗащита 🔪25/🧪5/⚡️25'
}

#LScrWard
LEXICON_scribe_wardrobe: dict[str, str] = {
    'helmet_kosmonavt': f'Шлем космонавта - Стандартный шлем космонавта.\n'
                        f'Грамостки,тяжелый и неудобный.\n'
                        f'Балистическая защита-5\n'
                        f'Химическая защита-35\n'
                        f'Электрическая Защита-45\n',
    'helmet_wanderer':  f'Шлем Странника - Легкая и простая защита головы.\n'
                        f'Можно сделать изтого что есть под рукой.\n'
                        f'Балистическая защита-10\n'
                        f'Химическая защита-10\n'
                        f'Электрическая Защита-10\n',
    'helmet_reinforced': f'Улучшенный шлем - Шлем странника.\n'
                         f'Усиленный каркасом из костей и перетяннутый жилами.\n'
                         f'Балистическая защита-15\n'
                         f'Химическая защита-10\n'
                         f'Электрическая Защита-10\n',
    'dress_kosmonavt':  f'Костюм космонавта - Стандартный костюм космонавта.\n'
                        f'Жаркий, неудобный большой и очень заметный.\n'
                        f'Балистическая защита-10\n'
                        f'Химическая защита-30\n'
                        f'Электрическая Защита-35\n',
    'dress_wanderer':   f'Костюм Странника - Легкая и простая защита тела.\n'
                        f'Можно сделать из того что есть под рукой.\n'
                        f'Балистическая защита-15\n'
                        f'Химическая защита-10\n'
                        f'Электрическая Защита-5\n',
    'dress_reinforced': f'Улучшенный костюм - Костюм странника.\n'
                        f'Усиленный каркасом из костей и перетяннутый жилами.\n'
                        f'Балистическая защита-20\n'
                        f'Химическая защита-15\n'
                        f'Электрическая Защита-10\n',
    'shoes_kosmonavt':  f'Ботинки космонавта - Стандартный ботинки космонавта.\n'
                        f'Тяжелые и шумные.\n'
                        f'Баллистическая защита-5\n'
                        f'Химическая защита-30\n'
                        f'Электрическая Защита-35\n',
    'shoes_wanderer':   f'Ботинки Странника - Легкая и простая защита ног.\n'
                        f'Можно сделать из того что есть под рукой.\n'
                        f'Баллистическая защита-5\n'
                        f'Химическая защита-5\n'
                        f'Электрическая Защита-5\n',
    'shoes_reinforced': f'Улучшенный ботинки - Ботинки странника.\n'
                        f'Усиленные каркасом из костей и перетянутый жилами.\n'
                        f'Баллистическая защита-10\n'
                        f'Химическая защита-10\n'
                        f'Электрическая Защита-5\n',
    'backpack_foliage': f'Рюкзак лиственный - простой рюкзак сделаный из подручных сретств\n'
                        f'4 ячейки\n',
    'backpack_leana' :  f'Рюкзак лиственно-лиановый - рюкзак лиственный укремоенный костями и жилами\n'
                        f'6 ячеек\n'
}


#LScrGun
LEXICON_scribe_gun: dict[str, str] = {
    'G17': f'Земной пистолет преднаначен для среднего и ближнего боя.',
    'spear': 'Крепкая легкая палка с наконечником из заточенной кости \nпредназначен для ближнего боя'
}



# check_xp_put_on_backpack_if_more_then_zero

# xp_backpack_is_over_remove_things_delate_backpack
    # all_things_can_be_moved_from_backpack_with_zero_xp_to_pocket

# delete_all_things_from_put_on_backpack

# dict_with_all_things_from_backpack

# modify_dict_with_all_things_from_backpack_to_srt_with_enter